Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ2048EFM144.atdf
         <register caption="ADC Digital Comparator 4 Control Register" name="ADCCMPCON4" offset="0xac" rw="RW" size="4">
            <bitfield caption="Low/Low Digital Comparator x Event bit" mask="0x00000001" name="IELOLO" values="ADCCMPCON4__IELOLO"/>
            <bitfield caption="Low/High Digital Comparator x Event bit" mask="0x00000002" name="IELOHI" values="ADCCMPCON4__IELOHI"/>
            <bitfield caption="High/Low Digital Comparator x Event bit" mask="0x00000004" name="IEHILO" values="ADCCMPCON4__IEHILO"/>
            <bitfield caption="High/High Digital Comparator x Event bit" mask="0x00000008" name="IEHIHI" values="ADCCMPCON4__IEHIHI"/>
            <bitfield caption="Between Low/High Digital Comparator x Event bit" mask="0x00000010" name="IEBTWN" values="ADCCMPCON4__IEBTWN"/>
            <bitfield caption="Digital Comparator x Output True Event Status bit" mask="0x00000020" name="DCMPED" values="ADCCMPCON4__DCMPED"/>
            <bitfield caption="Digital Comparator x Global Interrupt Enable bit" mask="0x00000040" name="DCMPGIEN" values="ADCCMPCON4__DCMPGIEN"/>
            <bitfield caption="Digital Comparator x Enable bit" mask="0x00000080" name="ENDCMP" values="ADCCMPCON4__ENDCMP"/>
            <bitfield caption="Digital Comparator x Analog Input Identification bits" mask="0x00001F00" name="AINID" values="ADCCMPCON4__AINID"/>
         </register>
         <register caption="ADC Digital Comparator 5 Control Register" name="ADCCMPCON5" offset="0xb0" rw="RW" size="4">
            <bitfield caption="Low/Low Digital Comparator x Event bit" mask="0x00000001" name="IELOLO" values="ADCCMPCON5__IELOLO"/>
            <bitfield caption="Low/High Digital Comparator x Event bit" mask="0x00000002" name="IELOHI" values="ADCCMPCON5__IELOHI"/>
            <bitfield caption="High/Low Digital Comparator x Event bit" mask="0x00000004" name="IEHILO" values="ADCCMPCON5__IEHILO"/>
            <bitfield caption="High/High Digital Comparator x Event bit" mask="0x00000008" name="IEHIHI" values="ADCCMPCON5__IEHIHI"/>
            <bitfield caption="Between Low/High Digital Comparator x Event bit" mask="0x00000010" name="IEBTWN" values="ADCCMPCON5__IEBTWN"/>
            <bitfield caption="Digital Comparator x Output True Event Status bit" mask="0x00000020" name="DCMPED" values="ADCCMPCON5__DCMPED"/>
            <bitfield caption="Digital Comparator x Global Interrupt Enable bit" mask="0x00000040" name="DCMPGIEN" values="ADCCMPCON5__DCMPGIEN"/>
            <bitfield caption="Digital Comparator x Enable bit" mask="0x00000080" name="ENDCMP" values="ADCCMPCON5__ENDCMP"/>
            <bitfield caption="Digital Comparator x Analog Input Identification bits" mask="0x00001F00" name="AINID" values="ADCCMPCON5__AINID"/>
         </register>
         <register caption="ADC Digital Comparator 6 Control Register" name="ADCCMPCON6" offset="0xb4" rw="RW" size="4">
            <bitfield caption="Low/Low Digital Comparator x Event bit" mask="0x00000001" name="IELOLO" values="ADCCMPCON6__IELOLO"/>
            <bitfield caption="Low/High Digital Comparator x Event bit" mask="0x00000002" name="IELOHI" values="ADCCMPCON6__IELOHI"/>
            <bitfield caption="High/Low Digital Comparator x Event bit" mask="0x00000004" name="IEHILO" values="ADCCMPCON6__IEHILO"/>
            <bitfield caption="High/High Digital Comparator x Event bit" mask="0x00000008" name="IEHIHI" values="ADCCMPCON6__IEHIHI"/>
            <bitfield caption="Between Low/High Digital Comparator x Event bit" mask="0x00000010" name="IEBTWN" values="ADCCMPCON6__IEBTWN"/>
            <bitfield caption="Digital Comparator x Output True Event Status bit" mask="0x00000020" name="DCMPED" values="ADCCMPCON6__DCMPED"/>
            <bitfield caption="Digital Comparator x Global Interrupt Enable bit" mask="0x00000040" name="DCMPGIEN" values="ADCCMPCON6__DCMPGIEN"/>
            <bitfield caption="Digital Comparator x Enable bit" mask="0x00000080" name="ENDCMP" values="ADCCMPCON6__ENDCMP"/>
            <bitfield caption="Digital Comparator x Analog Input Identification bits" mask="0x00001F00" name="AINID" values="ADCCMPCON6__AINID"/>
         </register>
         <register caption="ADC FIFO Status Register" name="ADCFSTAT" offset="0xb8" rw="RW" size="4">
            <bitfield caption="ADCx Identifier bits" mask="0x00000007" name="ADCID" values="ADCFSTAT__ADCID"/>
            <bitfield mask="0x00000080" name="FSIGN"/>
            <bitfield mask="0x0000FF00" name="FCNT"/>
            <bitfield caption="FIFO Write Overflow Error Status bit" mask="0x00200000" name="FWROVERR" values="ADCFSTAT__FWROVERR"/>
            <bitfield caption="FIFO Data Ready Interrupt Status bit" mask="0x00400000" name="FRDY" values="ADCFSTAT__FRDY"/>
            <bitfield caption="FIFO Interrupt Enable bit" mask="0x00800000" name="FIEN" values="ADCFSTAT__FIEN"/>
            <bitfield caption="ADC0 Enable bit" mask="0x01000000" name="ADC0EN" values="ADCFSTAT__ADC0EN"/>
            <bitfield caption="ADC1 Enable bit" mask="0x02000000" name="ADC1EN" values="ADCFSTAT__ADC1EN"/>
            <bitfield caption="ADC2 Enable bit" mask="0x04000000" name="ADC2EN" values="ADCFSTAT__ADC2EN"/>
            <bitfield caption="ADC3 Enable bit" mask="0x08000000" name="ADC3EN" values="ADCFSTAT__ADC3EN"/>
            <bitfield caption="ADC4 Enable bit" mask="0x10000000" name="ADC4EN" values="ADCFSTAT__ADC4EN"/>
            <bitfield mask="0x20000000" name="ADC5EN"/>
            <bitfield mask="0x40000000" name="ADC6EN"/>
            <bitfield caption="FIFO Enable bit" mask="0x80000000" name="FEN" values="ADCFSTAT__FEN"/>
         </register>
         <register caption="ADC FIFO Data Register" name="ADCFIFO" offset="0xbc" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA"/>
         </register>
         <register caption="ADC Base Register" name="ADCBASE" offset="0xc0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="ADCBASE"/>
         </register>
         <register caption="ADC Trigger Level/Edge Sensitivity Register" name="ADCTRGSNS" offset="0xd0" rw="RW" size="4">
            <bitfield caption="Trigger Level and Edge Sensitivity bit 0" mask="0x00000001" name="LVL0" values="ADCTRGSNS__LVL0"/>
            <bitfield caption="Trigger Level and Edge Sensitivity bit 1" mask="0x00000002" name="LVL1" values="ADCTRGSNS__LVL1"/>
            <bitfield caption="Trigger Level and Edge Sensitivity bit 2" mask="0x00000004" name="LVL2" values="ADCTRGSNS__LVL2"/>
            <bitfield caption="Trigger Level and Edge Sensitivity bit 3" mask="0x00000008" name="LVL3" values="ADCTRGSNS__LVL3"/>
            <bitfield caption="Trigger Level and Edge Sensitivity bit 4" mask="0x00000010" name="LVL4" values="ADCTRGSNS__LVL4"/>
            <bitfield caption="Trigger Level and Edge Sensitivity bit 5" mask="0x00000020" name="LVL5" values="ADCTRGSNS__LVL5"/>
            <bitfield caption="Trigger Level and Edge Sensitivity bit 6" mask="0x00000040" name="LVL6" values="ADCTRGSNS__LVL6"/>
            <bitfield caption="Trigger Level and Edge Sensitivity bit 7" mask="0x00000080" name="LVL7" values="ADCTRGSNS__LVL7"/>
            <bitfield caption="Trigger Level and Edge Sensitivity bit 8" mask="0x00000100" name="LVL8" values="ADCTRGSNS__LVL8"/>
            <bitfield caption="Trigger Level and Edge Sensitivity bit 9" mask="0x00000200" name="LVL9" values="ADCTRGSNS__LVL9"/>
            <bitfield caption="Trigger Level and Edge Sensitivity bit 10" mask="0x00000400" name="LVL10" values="ADCTRGSNS__LVL10"/>
            <bitfield caption="Trigger Level and Edge Sensitivity bit 11" mask="0x00000800" name="LVL11" values="ADCTRGSNS__LVL11"/>
            <bitfield mask="0x00001000" name="LVL12"/>
            <bitfield mask="0x00002000" name="LVL13"/>
            <bitfield mask="0x00004000" name="LVL14"/>
            <bitfield mask="0x00008000" name="LVL15"/>
            <bitfield mask="0x00010000" name="LVL16"/>
            <bitfield mask="0x00020000" name="LVL17"/>
            <bitfield mask="0x00040000" name="LVL18"/>
            <bitfield mask="0x00080000" name="LVL19"/>
            <bitfield mask="0x00100000" name="LVL20"/>
            <bitfield mask="0x00200000" name="LVL21"/>
            <bitfield mask="0x00400000" name="LVL22"/>
            <bitfield mask="0x00800000" name="LVL23"/>
            <bitfield mask="0x01000000" name="LVL24"/>
            <bitfield mask="0x02000000" name="LVL25"/>
            <bitfield mask="0x04000000" name="LVL26"/>
            <bitfield mask="0x08000000" name="LVL27"/>
            <bitfield mask="0x10000000" name="LVL28"/>
            <bitfield mask="0x20000000" name="LVL29"/>
            <bitfield mask="0x40000000" name="LVL30"/>
            <bitfield mask="0x80000000" name="LVL31"/>
         </register>
         <register caption="Dedicated ADC0 Timing Register x (x = 0 through 4)" name="ADC0TIME" initval="0x03000000" offset="0xd4" rw="RW" size="4">
            <bitfield caption="ADC0 Sample Time bits" mask="0x000003FF" name="SAMC" values="ADC0TIME__SAMC"/>
            <bitfield caption="ADC0 Clock 2x Divisor bits" mask="0x007F0000" name="ADCDIV" values="ADC0TIME__ADCDIV"/>
            <bitfield caption="ADC0 Resolution Select bits" mask="0x03000000" name="SELRES" values="ADC0TIME__SELRES"/>
            <bitfield caption="ADC0 Early Interrupt Select bits" mask="0x1C000000" name="ADCEIS" values="ADC0TIME__ADCEIS"/>
         </register>
         <register caption="Dedicated ADC1 Timing Register x (x = 0 through 4)" name="ADC1TIME" initval="0x03000000" offset="0xd8" rw="RW" size="4">
            <bitfield caption="ADC1 Sample Time bits" mask="0x000003FF" name="SAMC" values="ADC1TIME__SAMC"/>
            <bitfield caption="ADC1 Clock 2x Divisor bits" mask="0x007F0000" name="ADCDIV" values="ADC1TIME__ADCDIV"/>
            <bitfield caption="ADC1 Resolution Select bits" mask="0x03000000" name="SELRES" values="ADC1TIME__SELRES"/>
            <bitfield caption="ADC1 Early Interrupt Select bits" mask="0x1C000000" name="ADCEIS" values="ADC1TIME__ADCEIS"/>
         </register>
