Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ2048EFM144.atdf
      <value-group caption="Extended Identifier bits" name="C1RXM0__EID">
         <value caption="Include bit, EIDx, in filter comparison" name="" value="0x1"/>
         <value caption="Bit EIDx is dont care in filter operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="C1RXM0__MIDE">
         <value caption="Match only message types (standard/extended address) that correspond to the EXID bit in filter" name="" value="0x1"/>
         <value caption="Match either standard or extended address message if filters match (that is, if (Filter SID) = (Message SID) or if (FILTER SID/EID) = (Message SID/EID))" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXM0__SID">
         <value caption="Include bit, SIDx, in filter comparison" name="" value="0x1"/>
         <value caption="Bit SIDx is dont care in filter operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C2RXM0__EID">
         <value caption="Include bit, EIDx, in filter comparison" name="" value="0x1"/>
         <value caption="Bit EIDx is dont care in filter operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="C2RXM0__MIDE">
         <value caption="Match only message types (standard/extended address) that correspond to the EXID bit in filter" name="" value="0x1"/>
         <value caption="Match either standard or extended address message if filters match (that is, if (Filter SID) = (Message SID) or if (FILTER SID/EID) = (Message SID/EID))" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C2RXM0__SID">
         <value caption="Include bit, SIDx, in filter comparison" name="" value="0x1"/>
         <value caption="Bit SIDx is dont care in filter operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXM1__EID">
         <value caption="Include bit, EIDx, in filter comparison" name="" value="0x1"/>
         <value caption="Bit EIDx is dont care in filter operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="C1RXM1__MIDE">
         <value caption="Match only message types (standard/extended address) that correspond to the EXID bit in filter" name="" value="0x1"/>
         <value caption="Match either standard or extended address message if filters match (that is, if (Filter SID) = (Message SID) or if (FILTER SID/EID) = (Message SID/EID))" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXM1__SID">
         <value caption="Include bit, SIDx, in filter comparison" name="" value="0x1"/>
         <value caption="Bit SIDx is dont care in filter operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C2RXM1__EID">
         <value caption="Include bit, EIDx, in filter comparison" name="" value="0x1"/>
         <value caption="Bit EIDx is dont care in filter operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="C2RXM1__MIDE">
         <value caption="Match only message types (standard/extended address) that correspond to the EXID bit in filter" name="" value="0x1"/>
         <value caption="Match either standard or extended address message if filters match (that is, if (Filter SID) = (Message SID) or if (FILTER SID/EID) = (Message SID/EID))" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C2RXM1__SID">
         <value caption="Include bit, SIDx, in filter comparison" name="" value="0x1"/>
         <value caption="Bit SIDx is dont care in filter operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXM2__EID">
         <value caption="Include bit, EIDx, in filter comparison" name="" value="0x1"/>
         <value caption="Bit EIDx is dont care in filter operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="C1RXM2__MIDE">
         <value caption="Match only message types (standard/extended address) that correspond to the EXID bit in filter" name="" value="0x1"/>
         <value caption="Match either standard or extended address message if filters match (that is, if (Filter SID) = (Message SID) or if (FILTER SID/EID) = (Message SID/EID))" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXM2__SID">
         <value caption="Include bit, SIDx, in filter comparison" name="" value="0x1"/>
         <value caption="Bit SIDx is dont care in filter operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C2RXM2__EID">
         <value caption="Include bit, EIDx, in filter comparison" name="" value="0x1"/>
         <value caption="Bit EIDx is dont care in filter operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="C2RXM2__MIDE">
         <value caption="Match only message types (standard/extended address) that correspond to the EXID bit in filter" name="" value="0x1"/>
         <value caption="Match either standard or extended address message if filters match (that is, if (Filter SID) = (Message SID) or if (FILTER SID/EID) = (Message SID/EID))" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C2RXM2__SID">
         <value caption="Include bit, SIDx, in filter comparison" name="" value="0x1"/>
         <value caption="Bit SIDx is dont care in filter operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXM3__EID">
         <value caption="Include bit, EIDx, in filter comparison" name="" value="0x1"/>
         <value caption="Bit EIDx is dont care in filter operation" name="" value="0x0"/>
      </value-group>
