Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ2048EFM144.atdf
      <value-group caption="Input Capture Module Enable bit" name="IC5CON__ON">
         <value caption="Module is enabled" name="" value="0x1"/>
         <value caption="Disable and reset module" name="" value="0x0"/>
      </value-group>
      <value-group caption="Input Capture Mode Select bits" name="IC6CON__ICM">
         <value caption="Interrupt-Only mode (only supported while in Sleep mode or Idle mode)" name="" value="0x7"/>
         <value caption="Simple Capture Event mode every edge" name="" value="0x6"/>
         <value caption="Prescaled Capture Event mode every sixteenth rising edge" name="" value="0x5"/>
         <value caption="Prescaled Capture Event mode every fourth rising edge" name="" value="0x4"/>
         <value caption="Simple Capture Event mode every rising edge" name="" value="0x3"/>
         <value caption="Simple Capture Event mode every falling edge" name="" value="0x2"/>
         <value caption="Edge Detect mode every edge (rising and falling)" name="" value="0x1"/>
         <value caption="Input Capture module is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Input Capture Buffer Not Empty Status bit" name="IC6CON__ICBNE">
         <value caption="Input capture buffer is not empty; at least one more capture value can be read" name="" value="0x1"/>
         <value caption="Input capture buffer is empty" name="" value="0x0"/>
      </value-group>
      <value-group caption="Input Capture Overflow Status Flag bit" name="IC6CON__ICOV">
         <value caption="Input capture overflow is occurred" name="" value="0x1"/>
         <value caption="No input capture overflow is occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Control bits" name="IC6CON__ICI">
         <value caption="Interrupt on every fourth capture event" name="" value="0x3"/>
         <value caption="Interrupt on every third capture event" name="" value="0x2"/>
         <value caption="Interrupt on every second capture event" name="" value="0x1"/>
         <value caption="Interrupt on every capture event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer Select bit" name="IC6CON__ICTMR">
         <value caption="Timery is the counter source for capture" name="" value="0x0"/>
         <value caption="Timerx is the counter source for capture" name="" value="0x1"/>
      </value-group>
      <value-group caption="32-bit Capture Select bit" name="IC6CON__C32">
         <value caption="32-bit timer resource capture" name="" value="0x1"/>
         <value caption="16-bit timer resource capture" name="" value="0x0"/>
      </value-group>
      <value-group caption="First Capture Edge Select bit" name="IC6CON__FEDGE">
         <value caption="Capture rising edge first" name="" value="0x1"/>
         <value caption="Capture falling edge first" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop in Idle Control bit" name="IC6CON__SIDL">
         <value caption="Halt in CPU Idle mode" name="" value="0x1"/>
         <value caption="Continue to operate in CPU Idle mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Input Capture Module Enable bit" name="IC6CON__ON">
         <value caption="Module is enabled" name="" value="0x1"/>
         <value caption="Disable and reset module" name="" value="0x0"/>
      </value-group>
      <value-group caption="Input Capture Mode Select bits" name="IC7CON__ICM">
         <value caption="Interrupt-Only mode (only supported while in Sleep mode or Idle mode)" name="" value="0x7"/>
         <value caption="Simple Capture Event mode every edge" name="" value="0x6"/>
         <value caption="Prescaled Capture Event mode every sixteenth rising edge" name="" value="0x5"/>
         <value caption="Prescaled Capture Event mode every fourth rising edge" name="" value="0x4"/>
         <value caption="Simple Capture Event mode every rising edge" name="" value="0x3"/>
         <value caption="Simple Capture Event mode every falling edge" name="" value="0x2"/>
         <value caption="Edge Detect mode every edge (rising and falling)" name="" value="0x1"/>
         <value caption="Input Capture module is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Input Capture Buffer Not Empty Status bit" name="IC7CON__ICBNE">
         <value caption="Input capture buffer is not empty; at least one more capture value can be read" name="" value="0x1"/>
         <value caption="Input capture buffer is empty" name="" value="0x0"/>
      </value-group>
      <value-group caption="Input Capture Overflow Status Flag bit" name="IC7CON__ICOV">
         <value caption="Input capture overflow is occurred" name="" value="0x1"/>
         <value caption="No input capture overflow is occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Control bits" name="IC7CON__ICI">
         <value caption="Interrupt on every fourth capture event" name="" value="0x3"/>
         <value caption="Interrupt on every third capture event" name="" value="0x2"/>
         <value caption="Interrupt on every second capture event" name="" value="0x1"/>
         <value caption="Interrupt on every capture event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer Select bit" name="IC7CON__ICTMR">
         <value caption="Timery is the counter source for capture" name="" value="0x0"/>
         <value caption="Timerx is the counter source for capture" name="" value="0x1"/>
      </value-group>
      <value-group caption="32-bit Capture Select bit" name="IC7CON__C32">
         <value caption="32-bit timer resource capture" name="" value="0x1"/>
         <value caption="16-bit timer resource capture" name="" value="0x0"/>
      </value-group>
      <value-group caption="First Capture Edge Select bit" name="IC7CON__FEDGE">
         <value caption="Capture rising edge first" name="" value="0x1"/>
         <value caption="Capture falling edge first" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop in Idle Control bit" name="IC7CON__SIDL">
         <value caption="Halt in CPU Idle mode" name="" value="0x1"/>
         <value caption="Continue to operate in CPU Idle mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Input Capture Module Enable bit" name="IC7CON__ON">
         <value caption="Module is enabled" name="" value="0x1"/>
         <value caption="Disable and reset module" name="" value="0x0"/>
      </value-group>
      <value-group caption="Input Capture Mode Select bits" name="IC8CON__ICM">
         <value caption="Interrupt-Only mode (only supported while in Sleep mode or Idle mode)" name="" value="0x7"/>
         <value caption="Simple Capture Event mode every edge" name="" value="0x6"/>
         <value caption="Prescaled Capture Event mode every sixteenth rising edge" name="" value="0x5"/>
         <value caption="Prescaled Capture Event mode every fourth rising edge" name="" value="0x4"/>
         <value caption="Simple Capture Event mode every rising edge" name="" value="0x3"/>
         <value caption="Simple Capture Event mode every falling edge" name="" value="0x2"/>
         <value caption="Edge Detect mode every edge (rising and falling)" name="" value="0x1"/>
         <value caption="Input Capture module is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Input Capture Buffer Not Empty Status bit" name="IC8CON__ICBNE">
         <value caption="Input capture buffer is not empty; at least one more capture value can be read" name="" value="0x1"/>
         <value caption="Input capture buffer is empty" name="" value="0x0"/>
      </value-group>
