Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ2048EFM144.atdf
         <register caption="" name="OC1R" offset="0x10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC1R"/>
         </register>
         <register caption="" name="OC2R" offset="0x210" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC2R"/>
         </register>
         <register caption="" name="OC3R" offset="0x410" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC3R"/>
         </register>
         <register caption="" name="OC4R" offset="0x610" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC4R"/>
         </register>
         <register caption="" name="OC5R" offset="0x810" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC5R"/>
         </register>
         <register caption="" name="OC6R" offset="0xa10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC6R"/>
         </register>
         <register caption="" name="OC7R" offset="0xc10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC7R"/>
         </register>
         <register caption="" name="OC8R" offset="0xe10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC8R"/>
         </register>
         <register caption="" name="OC9R" offset="0x1010" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC9R"/>
         </register>
         <register caption="" name="OC1RS" offset="0x20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC1RS"/>
         </register>
         <register caption="" name="OC2RS" offset="0x220" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC2RS"/>
         </register>
         <register caption="" name="OC3RS" offset="0x420" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC3RS"/>
         </register>
         <register caption="" name="OC4RS" offset="0x620" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC4RS"/>
         </register>
         <register caption="" name="OC5RS" offset="0x820" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC5RS"/>
         </register>
         <register caption="" name="OC6RS" offset="0xa20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC6RS"/>
         </register>
         <register caption="" name="OC7RS" offset="0xc20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC7RS"/>
         </register>
         <register caption="" name="OC8RS" offset="0xe20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC8RS"/>
         </register>
         <register caption="" name="OC9RS" offset="0x1020" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="OC9RS"/>
         </register>
      </register-group>
      <value-group caption="Output Compare Mode Select bits" name="OC1CON__OCM">
         <value caption="PWM mode on OCx; Fault pin enabled" name="" value="0x7"/>
         <value caption="PWM mode on OCx; Fault pin diabled" name="" value="0x6"/>
         <value caption="Initialize OCx pin low; generate continious output pulses on OCx pin" name="" value="0x5"/>
         <value caption="Initialize OCx pin low; generate single output pulse on OCx pin" name="" value="0x4"/>
         <value caption="Compare event toggles OCx pin" name="" value="0x3"/>
         <value caption="Initialize OCx pin high; compare event forces OCx pin low" name="" value="0x2"/>
         <value caption="Initialize OCx pin low; compare event forces OCx pin high" name="" value="0x1"/>
         <value caption="Output compare peripheral is disabled but continues to draw current" name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Compare Timer Select bit(2)" name="OC1CON__OCTSEL">
         <value caption="Timery is the clock source for this Output Compare module" name="" value="0x1"/>
         <value caption="Timerx is the clock source for this Output Compare module" name="" value="0x0"/>
      </value-group>
      <value-group caption="PWM Fault Condition Status bit(1)" name="OC1CON__OCFLT">
         <value caption="PWM Fault condition has occurred (cleared in HW only)" name="" value="0x1"/>
         <value caption="No PWM Fault condition has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="32-bit Compare Mode bit" name="OC1CON__OC32">
         <value caption="OCxR and/or OCxRS&lt;31:0&gt; are used for comparisions to the 32-bit timer source" name="" value="0x1"/>
         <value caption="OCxR and OCxRS&lt;15:0&gt; are used for comparisons to the 16-bit timer source" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="OC1CON__SIDL">
         <value caption="Discontinue operation when CPU enters Idle mode" name="" value="0x1"/>
         <value caption="Continue operation in Idle mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Compare Peripheral On bit" name="OC1CON__ON">
         <value caption="Output Compare peripheral is enabled" name="" value="0x1"/>
         <value caption="Output Compare peripheral is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Compare Mode Select bits" name="OC2CON__OCM">
         <value caption="PWM mode on OCx; Fault pin enabled" name="" value="0x7"/>
         <value caption="PWM mode on OCx; Fault pin diabled" name="" value="0x6"/>
         <value caption="Initialize OCx pin low; generate continious output pulses on OCx pin" name="" value="0x5"/>
         <value caption="Initialize OCx pin low; generate single output pulse on OCx pin" name="" value="0x4"/>
         <value caption="Compare event toggles OCx pin" name="" value="0x3"/>
         <value caption="Initialize OCx pin high; compare event forces OCx pin low" name="" value="0x2"/>
         <value caption="Initialize OCx pin low; compare event forces OCx pin high" name="" value="0x1"/>
         <value caption="Output compare peripheral is disabled but continues to draw current" name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Compare Timer Select bit(2)" name="OC2CON__OCTSEL">
         <value caption="Timery is the clock source for this Output Compare module" name="" value="0x1"/>
         <value caption="Timerx is the clock source for this Output Compare module" name="" value="0x0"/>
      </value-group>
      <value-group caption="PWM Fault Condition Status bit(1)" name="OC2CON__OCFLT">
         <value caption="PWM Fault condition has occurred (cleared in HW only)" name="" value="0x1"/>
         <value caption="No PWM Fault condition has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="32-bit Compare Mode bit" name="OC2CON__OC32">
         <value caption="OCxR and/or OCxRS&lt;31:0&gt; are used for comparisions to the 32-bit timer source" name="" value="0x1"/>
         <value caption="OCxR and OCxRS&lt;15:0&gt; are used for comparisons to the 16-bit timer source" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="OC2CON__SIDL">
         <value caption="Discontinue operation when CPU enters Idle mode" name="" value="0x1"/>
         <value caption="Continue operation in Idle mode" name="" value="0x0"/>
      </value-group>
