Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ2048EFM144.atdf
      <value-group caption="Region Priority Level bit" name="SBT0REG0__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT0REG1__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT0REG1__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT1REG0__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT1REG0__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT1REG2__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT1REG2__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT1REG3__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT1REG3__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT1REG4__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT1REG4__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT1REG5__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT1REG5__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT1REG6__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT1REG6__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT1REG7__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT1REG7__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT1REG8__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT1REG8__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT2REG0__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT2REG0__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT2REG1__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT2REG1__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT2REG2__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT2REG2__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
