Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ2048EFM144.atdf
      <value-group caption="Region Size bits" name="SBT8REG1__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT8REG1__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT9REG0__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT9REG0__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT9REG1__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT9REG1__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT10REG0__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT10REG0__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT11REG0__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT11REG0__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT11REG1__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT11REG1__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT12REG0__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT12REG0__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT13REG0__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT13REG0__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group0 Read Permissions bits" name="SBT0RD0__GROUP0">
         <value caption="Privilege Group 0 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 0 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group1 Read Permissions bits" name="SBT0RD0__GROUP1">
         <value caption="Privilege Group 1 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 1 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group2 Read Permissions bits" name="SBT0RD0__GROUP2">
         <value caption="Privilege Group 2 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 2 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group3 Read Permissions bits" name="SBT0RD0__GROUP3">
         <value caption="Privilege Group 3 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 3 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group0 Read Permissions bits" name="SBT0RD1__GROUP0">
         <value caption="Privilege Group 0 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 0 does not have read permission" name="" value="0x0"/>
      </value-group>
