Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ2048EFM144.atdf
         <register caption="" name="USBE5CSR3" offset="0x15c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="TEP"/>
            <bitfield mask="0x00000030" name="PROTOCOL"/>
            <bitfield mask="0x000000C0" name="SPEED"/>
            <bitfield mask="0x0000FF00" name="RXINTERV"/>
            <bitfield mask="0x0F000000" name="TXFIFOSZ"/>
            <bitfield mask="0xF0000000" name="RXFIFOSZ"/>
         </register>
         <register caption="" name="USBE6CSR0" offset="0x160" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="TXMAXP"/>
            <bitfield mask="0x0000F800" name="MULT"/>
            <bitfield mask="0x00010000" name="TXPKTRDY"/>
            <bitfield mask="0x00020000" name="FIFONE"/>
            <bitfield mask="0x00040000" name="ERROR"/>
            <bitfield mask="0x00080000" name="FLUSH"/>
            <bitfield mask="0x00100000" name="SETUPPKT"/>
            <bitfield mask="0x00200000" name="RXSTALL"/>
            <bitfield mask="0x00400000" name="CLRDT"/>
            <bitfield mask="0x00800000" name="NAKTMOUT"/>
            <bitfield mask="0x01000000" name="DATATGGL"/>
            <bitfield mask="0x02000000" name="DTWREN"/>
            <bitfield mask="0x04000000" name="DMAREQMD"/>
            <bitfield mask="0x08000000" name="FRCDATTG"/>
            <bitfield mask="0x10000000" name="DMAREQEN"/>
            <bitfield mask="0x20000000" name="MODE"/>
            <bitfield mask="0x80000000" name="AUTOSET"/>
         </register>
         <register caption="" name="USBE6CSR1" offset="0x164" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="RXMAXP"/>
            <bitfield mask="0x0000F800" name="MULT"/>
            <bitfield mask="0x00010000" name="RXPKTRDY"/>
            <bitfield mask="0x00020000" name="FIFOFULL"/>
            <bitfield mask="0x00040000" name="ERROR"/>
            <bitfield mask="0x00080000" name="DERRNAKT"/>
            <bitfield mask="0x00100000" name="FLUSH"/>
            <bitfield mask="0x00200000" name="REQPKT"/>
            <bitfield mask="0x00400000" name="RXSTALL"/>
            <bitfield mask="0x00800000" name="CLRDT"/>
            <bitfield mask="0x01000000" name="INCOMPRX"/>
            <bitfield mask="0x02000000" name="DATATGGL"/>
            <bitfield mask="0x04000000" name="DATATWEN"/>
            <bitfield mask="0x08000000" name="DMAREQMD"/>
            <bitfield mask="0x10000000" name="PIDERR"/>
            <bitfield mask="0x20000000" name="DMAREQEN"/>
            <bitfield mask="0x40000000" name="AUTORQ"/>
            <bitfield mask="0x80000000" name="AUTOCLR"/>
         </register>
         <register caption="" name="USBE6CSR2" offset="0x168" rw="RW" size="4">
            <bitfield mask="0x00003FFF" name="RXCNT"/>
            <bitfield mask="0x000F0000" name="TEP"/>
            <bitfield mask="0x00300000" name="PROTOCOL"/>
            <bitfield mask="0x00C00000" name="SPEED"/>
            <bitfield mask="0xFF000000" name="TXINTERV"/>
         </register>
         <register caption="" name="USBE6CSR3" offset="0x16c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="TEP"/>
            <bitfield mask="0x00000030" name="PROTOCOL"/>
            <bitfield mask="0x000000C0" name="SPEED"/>
            <bitfield mask="0x0000FF00" name="RXINTERV"/>
            <bitfield mask="0x0F000000" name="TXFIFOSZ"/>
            <bitfield mask="0xF0000000" name="RXFIFOSZ"/>
         </register>
         <register caption="" name="USBE7CSR0" offset="0x170" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="TXMAXP"/>
            <bitfield mask="0x0000F800" name="MULT"/>
            <bitfield mask="0x00010000" name="TXPKTRDY"/>
            <bitfield mask="0x00020000" name="FIFONE"/>
            <bitfield mask="0x00040000" name="ERROR"/>
            <bitfield mask="0x00080000" name="FLUSH"/>
            <bitfield mask="0x00100000" name="SETUPPKT"/>
            <bitfield mask="0x00200000" name="RXSTALL"/>
            <bitfield mask="0x00400000" name="CLRDT"/>
            <bitfield mask="0x00800000" name="NAKTMOUT"/>
            <bitfield mask="0x01000000" name="DATATGGL"/>
            <bitfield mask="0x02000000" name="DTWREN"/>
            <bitfield mask="0x04000000" name="DMAREQMD"/>
            <bitfield mask="0x08000000" name="FRCDATTG"/>
            <bitfield mask="0x10000000" name="DMAREQEN"/>
            <bitfield mask="0x20000000" name="MODE"/>
            <bitfield mask="0x80000000" name="AUTOSET"/>
         </register>
         <register caption="USB DMA Interrupt Register" name="USBDMAINT" offset="0x200" rw="RW" size="4">
            <bitfield caption="DMA Channel 1 Interrupt bit" mask="0x00000001" name="DMA1IF" values="USBDMAINT__DMA1IF"/>
            <bitfield caption="DMA Channel 2 Interrupt bit" mask="0x00000002" name="DMA2IF" values="USBDMAINT__DMA2IF"/>
            <bitfield caption="DMA Channel 3 Interrupt bit" mask="0x00000004" name="DMA3IF" values="USBDMAINT__DMA3IF"/>
            <bitfield caption="DMA Channel 4 Interrupt bit" mask="0x00000008" name="DMA4IF" values="USBDMAINT__DMA4IF"/>
            <bitfield caption="DMA Channel 5 Interrupt bit" mask="0x00000010" name="DMA5IF" values="USBDMAINT__DMA5IF"/>
            <bitfield caption="DMA Channel 6 Interrupt bit" mask="0x00000020" name="DMA6IF" values="USBDMAINT__DMA6IF"/>
            <bitfield caption="DMA Channel 7 Interrupt bit" mask="0x00000040" name="DMA7IF" values="USBDMAINT__DMA7IF"/>
            <bitfield caption="DMA Channel 8 Interrupt bit" mask="0x00000080" name="DMA8IF" values="USBDMAINT__DMA8IF"/>
         </register>
         <register caption="USB DMA Channel 1 Memory Address Register" name="USBDMA1A" offset="0x208" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMAADDR"/>
         </register>
         <register caption="USB DMA Channel 1 Count Register" name="USBDMA1N" offset="0x20c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMACOUNT"/>
         </register>
         <register caption="USB DMA Channel 2 Memory Address Register" name="USBDMA2A" offset="0x218" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMAADDR"/>
         </register>
         <register caption="USB DMA Channel 2 Count Register" name="USBDMA2N" offset="0x21c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMACOUNT"/>
         </register>
         <register caption="USB DMA Channel 3 Memory Address Register" name="USBDMA3A" offset="0x228" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMAADDR"/>
         </register>
         <register caption="USB DMA Channel 3 Count Register" name="USBDMA3N" offset="0x22c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMACOUNT"/>
         </register>
