Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ2048EFM144.atdf
         <register caption="USB DMA Channel 4 Memory Address Register" name="USBDMA4A" offset="0x238" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMAADDR"/>
         </register>
         <register caption="USB DMA Channel 4 Count Register" name="USBDMA4N" offset="0x23c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMACOUNT"/>
         </register>
         <register caption="USB DMA Channel 5 Memory Address Register" name="USBDMA5A" offset="0x248" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMAADDR"/>
         </register>
         <register caption="USB DMA Channel 5 Count Register" name="USBDMA5N" offset="0x24c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMACOUNT"/>
         </register>
         <register caption="USB DMA Channel 6 Memory Address Register" name="USBDMA6A" offset="0x258" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMAADDR"/>
         </register>
         <register caption="USB DMA Channel 6 Count Register" name="USBDMA6N" offset="0x25c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMACOUNT"/>
         </register>
         <register caption="USB DMA Channel 7 Memory Address Register" name="USBDMA7A" offset="0x268" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMAADDR"/>
         </register>
         <register caption="USB DMA Channel 7 Count Register" name="USBDMA7N" offset="0x26c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMACOUNT"/>
         </register>
         <register caption="USB Endpoint 1 Request Packet Count Register (Host Mode Only)" name="USBE1RPC" offset="0x304" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="RQPKTCNT"/>
         </register>
         <register caption="USB Endpoint 2 Request Packet Count Register (Host Mode Only)" name="USBE2RPC" offset="0x308" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="RQPKTCNT"/>
         </register>
         <register caption="USB Endpoint 3 Request Packet Count Register (Host Mode Only)" name="USBE3RPC" offset="0x30c" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="RQPKTCNT"/>
         </register>
         <register caption="USB Endpoint 4 Request Packet Count Register (Host Mode Only)" name="USBE4RPC" offset="0x310" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="RQPKTCNT"/>
         </register>
      </register-group>
      <value-group caption="Suspend Mode Enable bit" name="USBCSR0__SUSPEN">
         <value caption="Suspend mode is enabled" name="" value="0x1"/>
         <value caption="Suspend mode is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Suspend Mode status bit" name="USBCSR0__SUSPMODE">
         <value caption="The USB module is in Suspend mode" name="" value="0x1"/>
         <value caption="The USB module is in Normal operations" name="" value="0x0"/>
      </value-group>
      <value-group caption="Resume from Suspend control bit" name="USBCSR0__RESUME">
         <value caption="Generate Resume signaling when the device is in Suspend mode" name="" value="0x1"/>
         <value caption="Stop Resume signaling" name="" value="0x0"/>
      </value-group>
      <value-group caption="Module Reset Status bit" name="USBCSR0__RESET">
         <value caption="Reset signaling is present on the bus" name="" value="0x1"/>
         <value caption="Normal module operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Hi-Speed Mode Status bit" name="USBCSR0__HSMODE">
         <value caption="Hi-Speed mode successfully negotiated during USB reset" name="" value="0x1"/>
         <value caption="Module is not in Hi-Speed mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Hi-Speed Enable bit" name="USBCSR0__HSEN">
         <value caption="The USB module will negotiate for Hi-Speed mode when the device is reset by the hub" name="" value="0x1"/>
         <value caption="Module only operates in Full-Speed mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Soft Connect/Disconnect Feature Selection bit" name="USBCSR0__SOFTCONN">
         <value caption="The USB D+/D- lines are enabled and active" name="" value="0x1"/>
         <value caption="The USB D+/D- lines are disabled and are tri-stated" name="" value="0x0"/>
      </value-group>
      <value-group caption="ISO Update bit (" name="USBCSR0__ISOUPD">
         <value caption="USB module will wait for a SOF token from the time TXPKTRDY is set before sending the packet" name="" value="0x1"/>
         <value caption="No change in behavior" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint 0 Interrupt bit" name="USBCSR0__EP0IF">
         <value caption="Endpoint 0 has an interrupt to be serviced" name="" value="0x1"/>
         <value caption="No interrupt event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint 1 TX Interrupt Flag bit" name="USBCSR0__EP1TXIF">
         <value caption="Endpoint has a transmit interrupt to be serviced" name="" value="0x1"/>
         <value caption="No interrupt event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint 2 TX Interrupt Flag bit" name="USBCSR0__EP2TXIF">
         <value caption="Endpoint has a transmit interrupt to be serviced" name="" value="0x1"/>
         <value caption="No interrupt event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint 3 TX Interrupt Flag bit" name="USBCSR0__EP3TXIF">
         <value caption="Endpoint has a transmit interrupt to be serviced" name="" value="0x1"/>
         <value caption="No interrupt event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint 4 TX Interrupt Flag bit" name="USBCSR0__EP4TXIF">
         <value caption="Endpoint has a transmit interrupt to be serviced" name="" value="0x1"/>
         <value caption="No interrupt event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint 5 TX Interrupt Flag bit" name="USBCSR0__EP5TXIF">
         <value caption="Endpoint has a transmit interrupt to be serviced" name="" value="0x1"/>
         <value caption="No interrupt event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint 6 TX Interrupt Flag bit" name="USBCSR0__EP6TXIF">
         <value caption="Endpoint has a transmit interrupt to be serviced" name="" value="0x1"/>
         <value caption="No interrupt event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint 7 TX Interrupt Flag bit" name="USBCSR0__EP7TXIF">
         <value caption="Endpoint has a transmit interrupt to be serviced" name="" value="0x1"/>
         <value caption="No interrupt event" name="" value="0x0"/>
      </value-group>
